
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 3 to change, 20 to destroy.</code></pre>

* Update
  * module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.darts_migration_key_vault.azurerm_key_vault.kv
  * module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_role_assignment.storage_contributors[&#34;87c8cf3d-ff9d-4d8f-8430-ccc737764435&#34;]
  * azurerm_storage_blob.b2c_copyright_png
  * azurerm_storage_blob.b2c_favicon
  * azurerm_storage_blob.b2c_login_css
  * azurerm_storage_blob.b2c_login_html
  * azurerm_storage_blob.b2c_logo_gov
  * azurerm_storage_blob.b2c_mfa_css
  * azurerm_storage_blob.b2c_mfa_html
  * azurerm_storage_blob.inbound
  * azurerm_storage_blob.outbound
  * azurerm_storage_blob.unstructured
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b31f6666-e2e4-4a0b-9399-b64446b1e412&#34;]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.sa.azurerm_storage_account.storage_account
  * module.sa.azurerm_storage_container.container[&#34;darts-inbound-container&#34;]
  * module.sa.azurerm_storage_container.container[&#34;darts-outbound&#34;]
  * module.sa.azurerm_storage_container.container[&#34;darts-st-container&#34;]
  * module.sa.azurerm_storage_container.container[&#34;darts-unstructured&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.storage_contributors["87c8cf3d-ff9d-4d8f-8430-ccc737764435"] must be replaced
-/+ resource "azurerm_role_assignment" "storage_contributors" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01/providers/Microsoft.Authorization/roleAssignments/43b95f87-89be-7477-9e4a-99e0f60f8f2c" -> (known after apply)
      ~ name                             = "43b95f87-89be-7477-9e4a-99e0f60f8f2c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01" # forces replacement -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_copyright_png must be replaced
-/+ resource "azurerm_storage_blob" "b2c_copyright_png" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/copyright.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "copyright.png"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/copyright.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_favicon must be replaced
-/+ resource "azurerm_storage_blob" "b2c_favicon" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "favicon.ico"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/favicon.ico" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_login_css must be replaced
-/+ resource "azurerm_storage_blob" "b2c_login_css" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/login.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.css"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/login.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_login_html must be replaced
-/+ resource "azurerm_storage_blob" "b2c_login_html" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/login.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.html"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/login.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_logo_gov must be replaced
-/+ resource "azurerm_storage_blob" "b2c_logo_gov" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/logo_gov.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "logo_gov.png"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/logo_gov.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_mfa_css must be replaced
-/+ resource "azurerm_storage_blob" "b2c_mfa_css" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/mfa.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "mfa.css"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/mfa.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_mfa_html must be replaced
-/+ resource "azurerm_storage_blob" "b2c_mfa_html" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/mfa.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "mfa.html"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/mfa.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.inbound must be replaced
-/+ resource "azurerm_storage_blob" "inbound" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-inbound-container/darts-inbound-blob-st-stg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "darts-inbound-blob-st-stg"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-inbound-container/darts-inbound-blob-st-stg" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.outbound must be replaced
-/+ resource "azurerm_storage_blob" "outbound" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/darts-outbound-blob-st-stg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "darts-outbound-blob-st-stg"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/darts-outbound-blob-st-stg" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.unstructured must be replaced
-/+ resource "azurerm_storage_blob" "unstructured" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/darts-unstrcutured-blob-st-stg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "darts-unstrcutured-blob-st-stg"
      ~ storage_account_name   = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ url                    = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container/darts-unstrcutured-blob-st-stg" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg|darts-stg"
        name                           = "darts-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.darts_migration_key_vault.data.azuread_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "developers" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS CFT Developers"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault.data.azuread_group.product_team[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "product_team" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Darts Modernisation"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.darts_migration_key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg"
        name                            = "darts-migration-stg"
        tags                            = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
      ~ tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
      ~ object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy["b31f6666-e2e4-4a0b-9399-b64446b1e412"] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b31f6666-e2e4-4a0b-9399-b64446b1e412" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/87c8cf3d-ff9d-4d8f-8430-ccc737764435" -> (known after apply)
      ~ object_id               = "87c8cf3d-ff9d-4d8f-8430-ccc737764435" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg|darts-migration-stg"
        name                           = "darts-migration-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa.azurerm_storage_account.storage_account must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
      ~ id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
      ~ name                              = "sastgdartsmig01" -> "dartssastg" # forces replacement
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://sastgdartsmig01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "sastgdartsmig01.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://sastgdartsmig01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "sastgdartsmig01.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://sastgdartsmig01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "sastgdartsmig01.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://sastgdartsmig01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "sastgdartsmig01.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://sastgdartsmig01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "sastgdartsmig01.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://sastgdartsmig01.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "sastgdartsmig01.z33.web.core.windows.net" -> (known after apply)
      ~ secondary_access_key              = (sensitive value)
      ~ secondary_blob_connection_string  = (sensitive value)
      ~ secondary_blob_endpoint           = "https://sastgdartsmig01-secondary.blob.core.windows.net/" -> (known after apply)
      ~ secondary_blob_host               = "sastgdartsmig01-secondary.blob.core.windows.net" -> (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      ~ secondary_dfs_endpoint            = "https://sastgdartsmig01-secondary.dfs.core.windows.net/" -> (known after apply)
      ~ secondary_dfs_host                = "sastgdartsmig01-secondary.dfs.core.windows.net" -> (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      ~ secondary_location                = "ukwest" -> (known after apply)
      ~ secondary_queue_endpoint          = "https://sastgdartsmig01-secondary.queue.core.windows.net/" -> (known after apply)
      ~ secondary_queue_host              = "sastgdartsmig01-secondary.queue.core.windows.net" -> (known after apply)
      ~ secondary_table_endpoint          = "https://sastgdartsmig01-secondary.table.core.windows.net/" -> (known after apply)
      ~ secondary_table_host              = "sastgdartsmig01-secondary.table.core.windows.net" -> (known after apply)
      ~ secondary_web_endpoint            = "https://sastgdartsmig01-secondary.z33.web.core.windows.net/" -> (known after apply)
      ~ secondary_web_host                = "sastgdartsmig01-secondary.z33.web.core.windows.net" -> (known after apply)
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (19 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.sa.azurerm_storage_container.container["darts-inbound-container"] must be replaced
-/+ resource "azurerm_storage_container" "container" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://sastgdartsmig01.blob.core.windows.net/darts-inbound-container" -> (known after apply)
      ~ metadata                = {} -> (known after apply)
        name                    = "darts-inbound-container"
      ~ resource_manager_id     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01/blobServices/default/containers/darts-inbound-container" -> (known after apply)
      ~ storage_account_name    = "sastgdartsmig01" -> "dartssastg" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.sa.azurerm_storage_container.container["darts-outbound"] must be replaced
-/+ resource "azurerm_storage_container" "container" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://sastgdartsmig01.blob.core.windows.net/darts-outbound" -> (known after apply)
      ~ metadata                = {} -> (known after apply)
        name                    = "darts-outbound"
      ~ resource_manager_id     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01/blobServices/default/containers/darts-outbound" -> (known after apply)
      ~ storage_account_name    = "sastgdartsmig01" -> "dartssastg" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.sa.azurerm_storage_container.container["darts-st-container"] must be replaced
-/+ resource "azurerm_storage_container" "container" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://sastgdartsmig01.blob.core.windows.net/darts-st-container" -> (known after apply)
      ~ metadata                = {} -> (known after apply)
        name                    = "darts-st-container"
      ~ resource_manager_id     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01/blobServices/default/containers/darts-st-container" -> (known after apply)
      ~ storage_account_name    = "sastgdartsmig01" -> "dartssastg" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.sa.azurerm_storage_container.container["darts-unstructured"] must be replaced
-/+ resource "azurerm_storage_container" "container" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://sastgdartsmig01.blob.core.windows.net/darts-unstructured" -> (known after apply)
      ~ metadata                = {} -> (known after apply)
        name                    = "darts-unstructured"
      ~ resource_manager_id     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01/blobServices/default/containers/darts-unstructured" -> (known after apply)
      ~ storage_account_name    = "sastgdartsmig01" -> "dartssastg" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 20 to add, 3 to change, 20 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":105,"Program":"tfcmt","SHA1":"","Vars":{}} -->